import React from 'react'

export default function Fotter() {
  return (
    <>
    <div className='w-full  bg-gray-800 h-max pb-6 pt-3 '>
     
     <div className='container  px-2 flex items-center flex-col mx-auto  '>
        <div className='w-full   border-b  flex  flex-col gap-y-12 h-56 justify-center items-center lg:flex-row lg:justify-between lg:items-center lg:h-[120px]'>
        <div className='flex text-white flex-col xs:h-[90px] gap-y-2 items-start justify-between   w-full   lg:w-1/2  lg:h-[72px] '>
          <h2 className='text-2xl '>ثبت نام در خبرنامه</h2>
          <p>شما میتوانید با وارد کردن ایمیل خود از جدیدترین اخبار سایت با خبر شوید</p>
        </div>

        <div className='w-full   h-1/4 lg:w-1/2  lg:h-1/2 flex lg:items-start justify-end '>
          <div className='w-full h-full border  rounded-lg flex justify-between items-center '>
          <input type="email" placeholder='ایمیل خود را وارد کنید' className='xs:w-9/12 text-white  w-10/12 h-full outline-0 rounded-r-lg bg-inherit pr-4' />
          <div className='xs:w-3/12 w-[130px] p-0.5 h-full flex items-center justify-center rounded-lg'>
          <button className='w-full h-full  xs:text-xsm md:text-sm text-ssm  rounded-lg bg-cyan-700 text-white'>ارسال ایمیل</button>
          </div>
          </div>
        </div>
        </div>
        </div>
       

      
      <div className='container  px-6 flex items-center flex-col mx-auto  '>

      <div className=' w-full   mt-10  items-center  pb-8 gap-y-6  md:h-full  grid   grid-cols-1 xl:grid-cols-6  lg:grid-cols-3  '>
        
          <div className=' md:col-span-2 col-span-1 flex flex-col justify-between '>
            <div className='w-full h-20 mb-2 '>
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" className='h-full fill-cyan-500'><path d="M22.2125 5.65605C21.4491 5.99375 20.6395 6.21555 19.8106 6.31411C20.6839 5.79132 21.3374 4.9689 21.6493 4.00005C20.8287 4.48761 19.9305 4.83077 18.9938 5.01461C18.2031 4.17106 17.098 3.69303 15.9418 3.69434C13.6326 3.69434 11.7597 5.56661 11.7597 7.87683C11.7597 8.20458 11.7973 8.52242 11.8676 8.82909C8.39047 8.65404 5.31007 6.99005 3.24678 4.45941C2.87529 5.09767 2.68005 5.82318 2.68104 6.56167C2.68104 8.01259 3.4196 9.29324 4.54149 10.043C3.87737 10.022 3.22788 9.84264 2.64718 9.51973C2.64654 9.5373 2.64654 9.55487 2.64654 9.57148C2.64654 11.5984 4.08819 13.2892 6.00199 13.6731C5.6428 13.7703 5.27232 13.8194 4.90022 13.8191C4.62997 13.8191 4.36771 13.7942 4.11279 13.7453C4.64531 15.4065 6.18886 16.6159 8.0196 16.6491C6.53813 17.8118 4.70869 18.4426 2.82543 18.4399C2.49212 18.4402 2.15909 18.4205 1.82812 18.3811C3.74004 19.6102 5.96552 20.2625 8.23842 20.2601C15.9316 20.2601 20.138 13.8875 20.138 8.36111C20.138 8.1803 20.1336 7.99886 20.1256 7.81997C20.9443 7.22845 21.651 6.49567 22.2125 5.65605Z" ></path></svg>
            </div>
            <div className=' w-full flex flex-col gap-y-2 h-max text-[14px] text-white font-bold'>
              <p>مطالب این وب گاه با هدف روشنگری شما تهیه و تدوین شده</p>
              <p>مطالب این وب گاه با هدف روشنگری شما تهیه و تدوین شده</p>
              <p>مطالب این وب گاه با هدف روشنگری شما تهیه و تدوین شده</p>
            </div>
            <div className='w-3/4 h-max flex justify-center  items-center mt-4 md:mt-6'>
              <div className='w-full h-[50px] xs:gap-x-2 flex md:justify-start gap-x-6 lg:items-center lg:justify-start xl:justify-between  '>
              <button className='h-full xs:h-[40px] xs:w-[45px] bg-gray-900  w-14  flex items-center justify-center rounded-md'>
              <svg xmlns="http://www.w3.org/2000/svg" className='  w-[30px] xl:mx-3 fill-white' viewBox="0 0 24 24" ><path d="M12.001 20C16.4193 20 20.001 16.4183 20.001 12C20.001 7.58172 16.4193 4 12.001 4C7.5827 4 4.00098 7.58172 4.00098 12C4.00098 16.4183 7.5827 20 12.001 20ZM12.001 22C6.47813 22 2.00098 17.5228 2.00098 12C2.00098 6.47715 6.47813 2 12.001 2C17.5238 2 22.001 6.47715 22.001 12C22.001 17.5228 17.5238 22 12.001 22ZM8.89113 13.1708L6.39308 12.3911C5.85317 12.2255 5.84996 11.854 6.51397 11.5871L16.247 7.82754C16.8115 7.59644 17.1325 7.88842 16.9495 8.61641L15.2917 16.4377C15.1763 16.9941 14.8407 17.1266 14.3759 16.8698L11.825 14.9823L10.6361 16.1297C10.5139 16.2476 10.4145 16.3489 10.2273 16.3743C10.04 16.3996 9.88564 16.3442 9.77337 16.0337L8.90378 13.1628L8.89113 13.1708Z"></path></svg>
              </button>
              <button className='h-full xs:h-[40px] xs:w-[45px] bg-gray-900 w-14 flex items-center justify-center rounded-md'>
              <svg xmlns="http://www.w3.org/2000/svg" className='w-[30px] xl:mx-3 fill-white' viewBox="0 0 24 24" ><path d="M4.00098 3H20.001C20.5533 3 21.001 3.44772 21.001 4V20C21.001 20.5523 20.5533 21 20.001 21H4.00098C3.44869 21 3.00098 20.5523 3.00098 20V4C3.00098 3.44772 3.44869 3 4.00098 3ZM5.00098 5V19H19.001V5H5.00098ZM7.50098 9C6.67255 9 6.00098 8.32843 6.00098 7.5C6.00098 6.67157 6.67255 6 7.50098 6C8.3294 6 9.00098 6.67157 9.00098 7.5C9.00098 8.32843 8.3294 9 7.50098 9ZM6.50098 10H8.50098V17.5H6.50098V10ZM12.001 10.4295C12.5854 9.86534 13.2665 9.5 14.001 9.5C16.072 9.5 17.501 11.1789 17.501 13.25V17.5H15.501V13.25C15.501 12.2835 14.7175 11.5 13.751 11.5C12.7845 11.5 12.001 12.2835 12.001 13.25V17.5H10.001V10H12.001V10.4295Z" ></path></svg>
              </button>
              <button className='h-full xs:h-[40px] xs:w-[45px] bg-gray-900 w-14 flex items-center justify-center rounded-md'>
              <svg xmlns="http://www.w3.org/2000/svg" className='w-[30px] xl:mx-3 fill-white' viewBox="0 0 24 24" ><path d="M15.3499 5.5498C13.7681 5.5498 12.4786 6.81785 12.4504 8.39633L12.4223 9.97138C12.4164 10.3027 12.143 10.5665 11.8117 10.5606C11.7881 10.5602 11.7646 10.5584 11.7413 10.5552L10.1805 10.3423C8.12699 10.0623 6.15883 9.11711 4.27072 7.54387C3.67275 10.8535 4.84 13.147 7.65342 14.9157L9.40041 16.014C9.68095 16.1904 9.7654 16.5608 9.58903 16.8413C9.54861 16.9056 9.49636 16.9616 9.43504 17.0064L7.84338 18.1693C8.78973 18.2288 9.68938 18.1873 10.435 18.0385C15.1526 17.097 18.2897 13.5468 18.2897 7.69084C18.2897 7.21275 17.2774 5.5498 15.3499 5.5498ZM10.4507 8.36066C10.4983 5.69559 12.6735 3.5498 15.3499 3.5498C16.7132 3.5498 17.9465 4.10658 18.8348 5.00515C19.5462 4.9998 20.1514 5.17966 21.5035 4.35943C21.1693 5.9998 21.0034 6.71177 20.2897 7.69084C20.2897 15.3324 15.5926 19.0487 10.8264 19.9998C7.5587 20.6519 2.80646 19.5812 1.44531 18.1584C2.13874 18.1051 4.95928 17.8018 6.58895 16.6089C5.20994 15.6984 -0.278631 12.4679 3.32772 3.78617C5.02119 5.76283 6.73797 7.10831 8.47807 7.82262C9.63548 8.29774 9.91978 8.28825 10.4507 8.36066Z"></path></svg>
              </button>
              <button className='h-full xs:h-[40px] xs:w-[45px] bg-gray-900 w-14   flex items-center justify-center rounded-md'>
              <svg xmlns="http://www.w3.org/2000/svg" className='w-[30px] xl:mx-3 fill-white' viewBox="0 0 24 24" width="24" ><path d="M12.001 9C10.3436 9 9.00098 10.3431 9.00098 12C9.00098 13.6573 10.3441 15 12.001 15C13.6583 15 15.001 13.6569 15.001 12C15.001 10.3427 13.6579 9 12.001 9ZM12.001 7C14.7614 7 17.001 9.2371 17.001 12C17.001 14.7605 14.7639 17 12.001 17C9.24051 17 7.00098 14.7629 7.00098 12C7.00098 9.23953 9.23808 7 12.001 7ZM18.501 6.74915C18.501 7.43926 17.9402 7.99917 17.251 7.99917C16.5609 7.99917 16.001 7.4384 16.001 6.74915C16.001 6.0599 16.5617 5.5 17.251 5.5C17.9393 5.49913 18.501 6.0599 18.501 6.74915ZM12.001 4C9.5265 4 9.12318 4.00655 7.97227 4.0578C7.18815 4.09461 6.66253 4.20007 6.17416 4.38967C5.74016 4.55799 5.42709 4.75898 5.09352 5.09255C4.75867 5.4274 4.55804 5.73963 4.3904 6.17383C4.20036 6.66332 4.09493 7.18811 4.05878 7.97115C4.00703 9.0752 4.00098 9.46105 4.00098 12C4.00098 14.4745 4.00753 14.8778 4.05877 16.0286C4.0956 16.8124 4.2012 17.3388 4.39034 17.826C4.5591 18.2606 4.7605 18.5744 5.09246 18.9064C5.42863 19.2421 5.74179 19.4434 6.17187 19.6094C6.66619 19.8005 7.19148 19.9061 7.97212 19.9422C9.07618 19.9939 9.46203 20 12.001 20C14.4755 20 14.8788 19.9934 16.0296 19.9422C16.8117 19.9055 17.3385 19.7996 17.827 19.6106C18.2604 19.4423 18.5752 19.2402 18.9074 18.9085C19.2436 18.5718 19.4445 18.2594 19.6107 17.8283C19.8013 17.3358 19.9071 16.8098 19.9432 16.0289C19.9949 14.9248 20.001 14.5389 20.001 12C20.001 9.52552 19.9944 9.12221 19.9432 7.97137C19.9064 7.18906 19.8005 6.66149 19.6113 6.17318C19.4434 5.74038 19.2417 5.42635 18.9084 5.09255C18.573 4.75715 18.2616 4.55693 17.8271 4.38942C17.338 4.19954 16.8124 4.09396 16.0298 4.05781C14.9258 4.00605 14.5399 4 12.001 4ZM12.001 2C14.7176 2 15.0568 2.01 16.1235 2.06C17.1876 2.10917 17.9135 2.2775 18.551 2.525C19.2101 2.77917 19.7668 3.1225 20.3226 3.67833C20.8776 4.23417 21.221 4.7925 21.476 5.45C21.7226 6.08667 21.891 6.81333 21.941 7.8775C21.9885 8.94417 22.001 9.28333 22.001 12C22.001 14.7167 21.991 15.0558 21.941 16.1225C21.8918 17.1867 21.7226 17.9125 21.476 18.55C21.2218 19.2092 20.8776 19.7658 20.3226 20.3217C19.7668 20.8767 19.2076 21.22 18.551 21.475C17.9135 21.7217 17.1876 21.89 16.1235 21.94C15.0568 21.9875 14.7176 22 12.001 22C9.28431 22 8.94514 21.99 7.87848 21.94C6.81431 21.8908 6.08931 21.7217 5.45098 21.475C4.79264 21.2208 4.23514 20.8767 3.67931 20.3217C3.12348 19.7658 2.78098 19.2067 2.52598 18.55C2.27848 17.9125 2.11098 17.1867 2.06098 16.1225C2.01348 15.0558 2.00098 14.7167 2.00098 12C2.00098 9.28333 2.01098 8.94417 2.06098 7.8775C2.11014 6.8125 2.27848 6.0875 2.52598 5.45C2.78014 4.79167 3.12348 4.23417 3.67931 3.67833C4.23514 3.1225 4.79348 2.78 5.45098 2.525C6.08848 2.2775 6.81348 2.11 7.87848 2.06C8.94514 2.0125 9.28431 2 12.001 2Z" ></path></svg>
              </button>
              </div>
            </div>

          </div>
          <div className=' flex flex-col  justify-between text-white'>
            <div className='h-1/5 mb-6 '>
            <p className='text-2xl w-fit h-full'>واحدها</p>
            </div>
          <ul className='h-4/5  flex justify-between flex-col gap-y-3 md:gap-y-6 '>
            <li className='cursor-pointer'>مهدویت</li>
            <li className='cursor-pointer'>امنیت غذایی</li>
            <li className='cursor-pointer'>معماری و شهر سازی</li>
            <li className='cursor-pointer'>دشمن شناسی</li>
          </ul>
          </div>

          <div className='  flex flex-col  justify-between text-white'>
            <div className='h-1/5 mb-6 '>
            <p className='text-2xl w-fit h-full'>واحدها</p>
            </div>
          <ul className='h-4/5 flex justify-between flex-col gap-y-3 md:gap-y-6 '>
            <li className='cursor-pointer'>فرق و ادیان</li>
            <li className='cursor-pointer'> آموزش و رسانه</li>
            <li className='cursor-pointer'>واحد موسیقی</li>
            <li className='cursor-pointer'>اقتصاد</li>
          </ul>
          </div>

          <div className=' flex flex-col justify-between text-white'>
            <div className='h-1/5 mb-6 '>
            <p className='text-2xl w-fit h-full'>صفحات</p>
            </div>
          <ul className='h-4/5  flex justify-between flex-col gap-y-3 md:gap-y-6 '>
            <li className='cursor-pointer'>پنل چند رسانه ای </li>
            <li className='cursor-pointer'>آرشیو کلیپها</li>
            <li className='cursor-pointer'>گالری تصاویر</li>
            <li className='cursor-pointer'>توییت</li>
          </ul>
          </div>

          <div className='  flex flex-col justify-between text-white '>
            <div className='h-1/5 mb-6 '>
            <p className='text-2xl w-fit h-full'>ارتباط با ما</p>
            </div>
          <ul className='h-4/5  flex justify-between flex-col gap-y-3 md:gap-y-6 '>
            <li className='flex items-center gap-x-2 cursor-pointer'>
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" className='w-6 fill-white'><path d="M9.36556 10.6821C10.302 12.3288 11.6712 13.698 13.3179 14.6344L14.2024 13.3961C14.4965 12.9845 15.0516 12.8573 15.4956 13.0998C16.9024 13.8683 18.4571 14.3353 20.0789 14.4637C20.599 14.5049 21 14.9389 21 15.4606V19.9234C21 20.4361 20.6122 20.8657 20.1022 20.9181C19.5723 20.9726 19.0377 21 18.5 21C9.93959 21 3 14.0604 3 5.5C3 4.96227 3.02742 4.42771 3.08189 3.89776C3.1343 3.38775 3.56394 3 4.07665 3H8.53942C9.0611 3 9.49513 3.40104 9.5363 3.92109C9.66467 5.54288 10.1317 7.09764 10.9002 8.50444C11.1427 8.9484 11.0155 9.50354 10.6039 9.79757L9.36556 10.6821ZM6.84425 10.0252L8.7442 8.66809C8.20547 7.50514 7.83628 6.27183 7.64727 5H5.00907C5.00303 5.16632 5 5.333 5 5.5C5 12.9558 11.0442 19 18.5 19C18.667 19 18.8337 18.997 19 18.9909V16.3527C17.7282 16.1637 16.4949 15.7945 15.3319 15.2558L13.9748 17.1558C13.4258 16.9425 12.8956 16.6915 12.3874 16.4061L12.3293 16.373C10.3697 15.2587 8.74134 13.6303 7.627 11.6707L7.59394 11.6126C7.30849 11.1044 7.05754 10.5742 6.84425 10.0252Z" ></path></svg>
            تلفن پشتیبانی
             </li>
            <li className='flex items-center gap-x-2 cursor-pointer'>
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" className='w-6 fill-white' ><path d="M3 3H21C21.5523 3 22 3.44772 22 4V20C22 20.5523 21.5523 21 21 21H3C2.44772 21 2 20.5523 2 20V4C2 3.44772 2.44772 3 3 3ZM20 7.23792L12.0718 14.338L4 7.21594V19H20V7.23792ZM4.51146 5L12.0619 11.662L19.501 5H4.51146Z" ></path></svg>
              ایمیل
            </li>
            <li className='flex items-center gap-x-2 cursor-pointer'>
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" className='w-6 fill-white' ><path d="M12 20.8995L16.9497 15.9497C19.6834 13.2161 19.6834 8.78392 16.9497 6.05025C14.2161 3.31658 9.78392 3.31658 7.05025 6.05025C4.31658 8.78392 4.31658 13.2161 7.05025 15.9497L12 20.8995ZM12 23.7279L5.63604 17.364C2.12132 13.8492 2.12132 8.15076 5.63604 4.63604C9.15076 1.12132 14.8492 1.12132 18.364 4.63604C21.8787 8.15076 21.8787 13.8492 18.364 17.364L12 23.7279ZM12 13C13.1046 13 14 12.1046 14 11C14 9.89543 13.1046 9 12 9C10.8954 9 10 9.89543 10 11C10 12.1046 10.8954 13 12 13ZM12 15C9.79086 15 8 13.2091 8 11C8 8.79086 9.79086 7 12 7C14.2091 7 16 8.79086 16 11C16 13.2091 14.2091 15 12 15Z" ></path></svg>
              آدرس
              </li>
            <li className='cursor-pointer'>تلگراف</li>
          </ul>
          </div>
          </div>
          
        
          
      </div>
      
      
    </div>
    <div className='w-full bg-gray-800 flex h-40 -mt-2 items-center justify-center  '>
    <div className='container   flex flex-col items-center justify-center gap-y-2 border-t pt-4 mx-4'>
    <svg xmlns="http://www.w3.org/2000/svg" className='fill-cyan-700 w-12' viewBox="0 0 24 24" ><path d="M22.2125 5.65605C21.4491 5.99375 20.6395 6.21555 19.8106 6.31411C20.6839 5.79132 21.3374 4.9689 21.6493 4.00005C20.8287 4.48761 19.9305 4.83077 18.9938 5.01461C18.2031 4.17106 17.098 3.69303 15.9418 3.69434C13.6326 3.69434 11.7597 5.56661 11.7597 7.87683C11.7597 8.20458 11.7973 8.52242 11.8676 8.82909C8.39047 8.65404 5.31007 6.99005 3.24678 4.45941C2.87529 5.09767 2.68005 5.82318 2.68104 6.56167C2.68104 8.01259 3.4196 9.29324 4.54149 10.043C3.87737 10.022 3.22788 9.84264 2.64718 9.51973C2.64654 9.5373 2.64654 9.55487 2.64654 9.57148C2.64654 11.5984 4.08819 13.2892 6.00199 13.6731C5.6428 13.7703 5.27232 13.8194 4.90022 13.8191C4.62997 13.8191 4.36771 13.7942 4.11279 13.7453C4.64531 15.4065 6.18886 16.6159 8.0196 16.6491C6.53813 17.8118 4.70869 18.4426 2.82543 18.4399C2.49212 18.4402 2.15909 18.4205 1.82812 18.3811C3.74004 19.6102 5.96552 20.2625 8.23842 20.2601C15.9316 20.2601 20.138 13.8875 20.138 8.36111C20.138 8.1803 20.1336 7.99886 20.1256 7.81997C20.9443 7.22845 21.651 6.49567 22.2125 5.65605Z" ></path></svg>
    <p className='text-white text-sm'>تمامی حقوق این سایت متعلق به موسسه </p>
    </div>
    </div>
   
    
    </>
  )
}
